; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p10---int100n150-m25---int100c200---s135---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 - fuellevel
)

(:init
(sum level0 level8 level8)
(sum level0 level15 level15)
(sum level0 level17 level17)
(sum level1 level8 level9)
(sum level1 level15 level16)
(sum level1 level17 level18)
(sum level2 level8 level10)
(sum level2 level15 level17)
(sum level2 level17 level19)
(sum level3 level8 level11)
(sum level3 level15 level18)
(sum level3 level17 level20)
(sum level4 level8 level12)
(sum level4 level15 level19)
(sum level4 level17 level21)
(sum level5 level8 level13)
(sum level5 level15 level20)
(sum level5 level17 level22)
(sum level6 level8 level14)
(sum level6 level15 level21)
(sum level6 level17 level23)
(sum level7 level8 level15)
(sum level7 level15 level22)
(sum level7 level17 level24)
(sum level8 level8 level16)
(sum level8 level15 level23)
(sum level8 level17 level25)
(sum level9 level8 level17)
(sum level9 level15 level24)
(sum level9 level17 level26)
(sum level10 level8 level18)
(sum level10 level15 level25)
(sum level10 level17 level27)
(sum level11 level8 level19)
(sum level11 level15 level26)
(sum level11 level17 level28)
(sum level12 level8 level20)
(sum level12 level15 level27)
(sum level12 level17 level29)
(sum level13 level8 level21)
(sum level13 level15 level28)
(sum level13 level17 level30)
(sum level14 level8 level22)
(sum level14 level15 level29)
(sum level14 level17 level31)
(sum level15 level8 level23)
(sum level15 level15 level30)
(sum level15 level17 level32)
(sum level16 level8 level24)
(sum level16 level15 level31)
(sum level16 level17 level33)
(sum level17 level8 level25)
(sum level17 level15 level32)
(sum level17 level17 level34)
(sum level18 level8 level26)
(sum level18 level15 level33)
(sum level18 level17 level35)
(sum level19 level8 level27)
(sum level19 level15 level34)
(sum level19 level17 level36)
(sum level20 level8 level28)
(sum level20 level15 level35)
(sum level20 level17 level37)
(sum level21 level8 level29)
(sum level21 level15 level36)
(sum level21 level17 level38)
(sum level22 level8 level30)
(sum level22 level15 level37)
(sum level22 level17 level39)
(sum level23 level8 level31)
(sum level23 level15 level38)
(sum level23 level17 level40)
(sum level24 level8 level32)
(sum level24 level15 level39)
(sum level24 level17 level41)
(sum level25 level8 level33)
(sum level25 level15 level40)
(sum level25 level17 level42)
(sum level26 level8 level34)
(sum level26 level15 level41)
(sum level26 level17 level43)
(sum level27 level8 level35)
(sum level27 level15 level42)
(sum level27 level17 level44)
(sum level28 level8 level36)
(sum level28 level15 level43)
(sum level28 level17 level45)
(sum level29 level8 level37)
(sum level29 level15 level44)
(sum level29 level17 level46)
(sum level30 level8 level38)
(sum level30 level15 level45)
(sum level30 level17 level47)
(sum level31 level8 level39)
(sum level31 level15 level46)
(sum level31 level17 level48)
(sum level32 level8 level40)
(sum level32 level15 level47)
(sum level32 level17 level49)
(sum level33 level8 level41)
(sum level33 level15 level48)
(sum level33 level17 level50)
(sum level34 level8 level42)
(sum level34 level15 level49)
(sum level34 level17 level51)
(sum level35 level8 level43)
(sum level35 level15 level50)
(sum level35 level17 level52)
(sum level36 level8 level44)
(sum level36 level15 level51)
(sum level36 level17 level53)
(sum level37 level8 level45)
(sum level37 level15 level52)
(sum level37 level17 level54)
(sum level38 level8 level46)
(sum level38 level15 level53)
(sum level38 level17 level55)
(sum level39 level8 level47)
(sum level39 level15 level54)
(sum level39 level17 level56)
(sum level40 level8 level48)
(sum level40 level15 level55)
(sum level40 level17 level57)
(sum level41 level8 level49)
(sum level41 level15 level56)
(sum level41 level17 level58)
(sum level42 level8 level50)
(sum level42 level15 level57)
(sum level42 level17 level59)
(sum level43 level8 level51)
(sum level43 level15 level58)
(sum level43 level17 level60)
(sum level44 level8 level52)
(sum level44 level15 level59)
(sum level44 level17 level61)
(sum level45 level8 level53)
(sum level45 level15 level60)
(sum level45 level17 level62)
(sum level46 level8 level54)
(sum level46 level15 level61)
(sum level46 level17 level63)
(sum level47 level8 level55)
(sum level47 level15 level62)
(sum level47 level17 level64)
(sum level48 level8 level56)
(sum level48 level15 level63)
(sum level48 level17 level65)
(sum level49 level8 level57)
(sum level49 level15 level64)
(sum level49 level17 level66)
(sum level50 level8 level58)
(sum level50 level15 level65)
(sum level50 level17 level67)
(sum level51 level8 level59)
(sum level51 level15 level66)
(sum level51 level17 level68)
(sum level52 level8 level60)
(sum level52 level15 level67)
(sum level52 level17 level69)
(sum level53 level8 level61)
(sum level53 level15 level68)
(sum level53 level17 level70)
(sum level54 level8 level62)
(sum level54 level15 level69)
(sum level54 level17 level71)
(sum level55 level8 level63)
(sum level55 level15 level70)
(sum level55 level17 level72)
(sum level56 level8 level64)
(sum level56 level15 level71)
(sum level56 level17 level73)
(sum level57 level8 level65)
(sum level57 level15 level72)
(sum level57 level17 level74)
(sum level58 level8 level66)
(sum level58 level15 level73)
(sum level58 level17 level75)
(sum level59 level8 level67)
(sum level59 level15 level74)
(sum level59 level17 level76)
(sum level60 level8 level68)
(sum level60 level15 level75)
(sum level60 level17 level77)
(sum level61 level8 level69)
(sum level61 level15 level76)
(sum level61 level17 level78)
(sum level62 level8 level70)
(sum level62 level15 level77)
(sum level62 level17 level79)
(sum level63 level8 level71)
(sum level63 level15 level78)
(sum level63 level17 level80)
(sum level64 level8 level72)
(sum level64 level15 level79)
(sum level64 level17 level81)
(sum level65 level8 level73)
(sum level65 level15 level80)
(sum level65 level17 level82)
(sum level66 level8 level74)
(sum level66 level15 level81)
(sum level66 level17 level83)
(sum level67 level8 level75)
(sum level67 level15 level82)
(sum level67 level17 level84)
(sum level68 level8 level76)
(sum level68 level15 level83)
(sum level68 level17 level85)
(sum level69 level8 level77)
(sum level69 level15 level84)
(sum level69 level17 level86)
(sum level70 level8 level78)
(sum level70 level15 level85)
(sum level70 level17 level87)
(sum level71 level8 level79)
(sum level71 level15 level86)
(sum level71 level17 level88)
(sum level72 level8 level80)
(sum level72 level15 level87)
(sum level72 level17 level89)
(sum level73 level8 level81)
(sum level73 level15 level88)
(sum level73 level17 level90)
(sum level74 level8 level82)
(sum level74 level15 level89)
(sum level74 level17 level91)
(sum level75 level8 level83)
(sum level75 level15 level90)
(sum level75 level17 level92)
(sum level76 level8 level84)
(sum level76 level15 level91)
(sum level77 level8 level85)
(sum level77 level15 level92)
(sum level78 level8 level86)
(sum level79 level8 level87)
(sum level80 level8 level88)
(sum level81 level8 level89)
(sum level82 level8 level90)
(sum level83 level8 level91)
(sum level84 level8 level92)

(connected l0 l1)
(fuelcost level8 l0 l1)
(connected l0 l2)
(fuelcost level15 l0 l2)
(connected l1 l0)
(fuelcost level8 l1 l0)
(connected l1 l2)
(fuelcost level17 l1 l2)
(connected l2 l0)
(fuelcost level15 l2 l0)
(connected l2 l1)
(fuelcost level17 l2 l1)

(at t0 l1)
(fuel t0 level92)
(= (total-cost) 0)

(at p0 l2)
(at p1 l1)
(at p2 l2)
(at p3 l2)
(at p4 l0)
(at p5 l2)
(at p6 l1)
(at p7 l0)
(at p8 l0)
(at p9 l1)
)

(:goal
(and
(at p0 l0)
(at p1 l0)
(at p2 l0)
(at p3 l1)
(at p4 l2)
(at p5 l0)
(at p6 l0)
(at p7 l2)
(at p8 l1)
(at p9 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p9 t0 l1)
   deleted: (at p9 l1)
   added: (in p9 t0)
   goals met: 0 of 10
2. (load p6 t0 l1)
   deleted: (at p6 l1)
   added: (in p6 t0)
   goals met: 0 of 10
3. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 0 of 10
4. (drive t0 l1 l0 level84 level8 level92)
   deleted: (at t0 l1) (fuel t0 level92)
   added: (at t0 l0) (fuel t0 level84)
   goals met: 0 of 10
5. (unload p6 t0 l0)
   deleted: (in p6 t0)
   added: (at p6 l0)
   goals met: 1 of 10
6. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 2 of 10
7. (load p8 t0 l0)
   deleted: (at p8 l0)
   added: (in p8 t0)
   goals met: 2 of 10
8. (load p7 t0 l0)
   deleted: (at p7 l0)
   added: (in p7 t0)
   goals met: 2 of 10
9. (load p4 t0 l0)
   deleted: (at p4 l0)
   added: (in p4 t0)
   goals met: 2 of 10
10. (drive t0 l0 l2 level69 level15 level84)
   deleted: (at t0 l0) (fuel t0 level84)
   added: (at t0 l2) (fuel t0 level69)
   goals met: 2 of 10
11. (unload p7 t0 l2)
   deleted: (in p7 t0)
   added: (at p7 l2)
   goals met: 3 of 10
12. (unload p4 t0 l2)
   deleted: (in p4 t0)
   added: (at p4 l2)
   goals met: 4 of 10
13. (load p5 t0 l2)
   deleted: (at p5 l2)
   added: (in p5 t0)
   goals met: 4 of 10
14. (load p3 t0 l2)
   deleted: (at p3 l2)
   added: (in p3 t0)
   goals met: 4 of 10
15. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 4 of 10
16. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 4 of 10
17. (drive t0 l2 l0 level54 level15 level69)
   deleted: (at t0 l2) (fuel t0 level69)
   added: (at t0 l0) (fuel t0 level54)
   goals met: 4 of 10
18. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 5 of 10
19. (unload p2 t0 l0)
   deleted: (in p2 t0)
   added: (at p2 l0)
   goals met: 6 of 10
20. (unload p5 t0 l0)
   deleted: (in p5 t0)
   added: (at p5 l0)
   goals met: 7 of 10
21. (unload p9 t0 l0)
   deleted: (in p9 t0)
   added: (at p9 l0)
   goals met: 8 of 10
22. (drive t0 l0 l1 level46 level8 level54)
   deleted: (at t0 l0) (fuel t0 level54)
   added: (at t0 l1) (fuel t0 level46)
   goals met: 8 of 10
23. (unload p3 t0 l1)
   deleted: (in p3 t0)
   added: (at p3 l1)
   goals met: 9 of 10
24. (unload p8 t0 l1)
   deleted: (in p8 t0)
   added: (at p8 l1)
   goals met: 10 of 10
